[
  {
    "name": "ENTP",
    "summary": "논쟁을 즐기는 변론가",
    "count": 0,
    "tag": [
      "호기심많은마음",
      "논쟁챔피언",
      "혁신가의삶",
      "상상력은무한대"
    ],
    "content": {
      "description": "ENTP 유형은 독창적인 혁신가이며, 창의력이 풍부하고 항상 새로운 가능성을 찾고 새로운 시도를 즐기는 유형입니다. 넓은 안목을 가지고 있으며 다방면에 재능이 있습니다. 풍부한 상상력과 어떤 프로젝트를 시도하는 솔선력이 강합니다. 민첩하고 여러 가지 일에 재능을 발휘하며 자신감이 넘쳐 납니다. 사람들의 동향에 대해 기민하고 박식한 편입니다. 다른 사람을 판단하기보다 이해하려고 노력합니다.",
      "good": {
        "name": "INFJ",
        "description": "ENTP는 INFJ의 차분하고 지능적이며 상상력이 풍부한 성격에 매력을 느낍니다. INFJ는 그들이 순조롭게 진행되도록 도울 수 있으며 깊은 대화에 대한 사랑을 공유합니다. 반면에 INFJ는 ENTP의 지성, 자신감, 에너지에 매력을 느낍니다. ENTP는 그들을 안락한 영역 밖으로 밀어내어 성장하도록 돕습니다."
      },
      "bad": {
        "name": "ESTJ",
        "description": "자유로운 성격의 ENTP는 자신이 하고 싶어하는 행동을 억압하는 ESTJ와 잘 맞지 않는 편입니다. 계획적이고, 통제력을 가진 ESTJ와는 잘 맞지 않습니다."
      }
    }
  },
  {
    "name": "ENFP",
    "summary": "재기발랄한 활동가",
    "count": 0,
    "tag": [
      "인생은파티",
      "독특한아이디어",
      "감성충전소",
      "자유로운영혼"
    ],
    "content": {
      "description": "ENFP 유형은 열성적이고 창의적입니다. 풍부한 상상력과 영감을 가지고 새로운 프로젝트를 잘 시작합니다. 풍부한 충동적 에너지를 가지고 즉흥적으로 일을 재빠르게 해결하는 솔선수범력과 상상력이 있습니다. 관심이 있는 일이면 무엇이든 척척 해내는 열성파입니다. 뛰어난 통찰력으로 그 사람 안에 있는 성장 발전할 가능성을 들여다봅니다. 또한 자신의 열성으로 다른 사람들도 어떤 프로젝트에 흥미를 가지게 하고 다른 사람을 잘 도와줍니다.",
      "good": {
        "name": "INFJ",
        "description": "ENFP는 INFJ의 깊이, 사려 깊음, 공감에 매력을 느낍니다. 그들은 때때로 방향이 부족할 수 있으며 INFJ는 그들이 더 근거 있고 집중하도록 도울 수 있습니다. 반면에 INFJ는 ENFP의 긍정적이고 친절하며 통찰력 있는 성격에 매력을 느낍니다. ENFP는 INFJ가 긴장을 풀고 즐겁게 지낼 수 있도록 도와줍니다."
      },
      "bad": {
        "name": "ESTP",
        "description": "ENFP는 상황 너머의 보이지 않는 이면까지 파악하고 결정을 내리려는 성향이 있습니다. 반면에 빠르게 상황을 판단하는 ESTP는 상환 자체만을 보고 단순히 옳고 그름을 논리적으로 생각하기 때문에 서로 갈등이 생길 수 있습니다."
      }
    }
  },
  {
    "name": "ENTJ",
    "summary": "대담한 통솔자",
    "count": 0,
    "tag": [
      "풍부한상상력",
      "완벽주의자",
      "강한지적욕구",
      "효율성추구"
    ],
    "content": {
      "description": "ENTJ 유형은 활동적이며 행정적인 일과 장기계획을 선호하며 논리적이고 분석적입니다. 사전 준비를 철저히 하며 계획하고 조직하고 체계적으로 목적달성을 추진시키는 지도자들이 많습니다. 비능률적이거나 확실치 않는 상황에 대해서는 별로 인내심이 없습니다. 그러나 상황이 필요로 할 때는 강하게 대처합니다. 솔직하고 결정력과 통솔력이 있으며, 거시적 안목으로 일을 밀고 나갑니다. 관념 자체에 집중하는 경향이 있으며, 관념 이면의 사람에게는 관심이 별로 없습니다.",
      "good": {
        "name": "INFP",
        "description": "ENTJ는 INFP의 수용적이고 진실하며 상상력이 풍부한 특성에 매력을 느낍니다. INFP는 그들이 완전히 새로운 관점에서 사물을 볼 수 있도록 도와주고 그들의 감정과 접촉하도록 격려할 수 있습니다. 반면에 INFP는 ENTJ의 야망, 지능 및 자신감 있는 성격에 매력을 느낍니다. ENTJ는 창의적인 아이디어를 현실로 만들기 위한 계획을 세우는 데 도움을 줄 수 있습니다."
      },
      "bad": {
        "name": "ISFJ",
        "description": "ENTJ는 모두의 입장을 일일이 아우르고 공감하는 척을 할 때가 있습니다. 하지만 ISFJ 눈에는 어설픈 페르소나로 비쳐질 뿐이며 사실은 상대방에게 비난 받지 않기 위한 잠깐의 모면일 뿐이란 것을 알 수 있습니다. ISFJ는 언뜻 볼 때 삶의 의미를 곱씹으며 살아가는 것처럼 또 현실에는 낙이 없다는 듯이 성숙하고 어른스러워 보입니다. 하지만 ENTJ는 이들의 어설픈 페르소나를 알아차릴 것이며 실은 그들의 생각이 단순하기 그지 없으며 깊이가 없다고 느낄 것입니다."
      }
    }
  },
  {
    "name": "ENFJ",
    "summary": "정의로운 사회운동가",
    "count": 0,
    "tag": [
      "임기응변",
      "핵인싸",
      "카리스마",
      "추진력"
    ],
    "content": {
      "description": "ENFJ 유형은 동정심과 동료애가 많으며, 친절하고 재치 있습니다. 민첩하고 참을성이 많고 성실합니다. 사람들과의 인화를 중요시 여기며, 다른 사람들의 의견을 존중하고 그 가치를 봅니다. 공동의 선(善)을 위해서는 대체로 상대방 의견에 동의하는 경향이 있습니다. 새로운 아이디어에 대한 호기심이 많습니다. 쓰기 보다는 말로써 생각을 잘 표현합니다. 편안하고 능란하게 계획을 제시하거나 조직을 이끌어 가는 능력이 있습니다.",
      "good": {
        "name": "INTP",
        "description": "ENFJ는 근거 있고 합리적이며 느긋한 INTP의 특성에 매력을 느낍니다. INTP는 다른 관점에서 사물을 볼 수 있도록 도와줍니다. 반면에 INTP는 ENFJ의 친절하고 공감하며 개방적인 특성에 끌립니다. ENFJ는 감정과 접촉하도록 도울 수 있습니다."
      },
      "bad": {
        "name": "ISTJ",
        "description": "ISTJ는 ENFJ의 가장 큰 장점인 타인의 감정을 읽어내고 사회적인 관계 속에서 배려와 조화를 이뤄나가는 것에 무관심합니다. ENFJ는 ISTJ가 깊이 현실에 종속되어 익숙한 사람들 속에서 친숙한 업무만을 우직하고도 충실하게 해나가는 것에 별 관심이 가지 않습니다."
      }
    }
  },
  {
    "name": "ESTP",
    "summary": "모험을 즐기는 사업가",
    "count": 0,
    "tag": [
      "핵인싸",
      "팩트폭격기",
      "문제해결왕",
      "뒤끝제로"
    ],
    "content": {
      "description": "ESTP 유형은 관대하고 느긋하며 어떤 사람이나 사건에 대해서 별로 선입관을 갖지 않으며 개방적입니다. 자신에게나 타인에게 있어 관용적이며, 일을 있는 그대로 보고 받아들입니다. 그래서 갈등이나 긴장이 일어나는 상황을 잘 무마하는 능력이 있습니다. ‘꼭 이렇게 되어야 하고, 저렇게 되어야 된다.’라는 규범을 적용하기보다 누구나 만족할 수 있는 해결책을 모색합니다. 또한 타협하고 적응하는 능력이 있습니다. 주의집중을 현재 상황에 맞추고, 현실을 있는 그대로 보는 이 유형의 자연스러운 경향으로 인해 현실적으로 야기되는 문제 해결에 뛰어난 능력을 발휘하기도 합니다.",
      "good": {
        "name": "ISFJ",
        "description": "ISFJ은 상대방에게 헌신하고 다정다감하기 때문에 여러 유형들과 궁합이 잘 맞지만, 인식기능이 동일한 감각형과 특히 잘 맞는 편입니다. 외향적인 ESTP 유형 같은 경우 내향적인 성향으로 대화를 시작하기 어려운 ISFJ들의 관계를 쉽게 열 수 있는 사람들입니다. 판단 기능과 생활 양식은 반대되지만, 이런 서로 다른 기능이 시너지 효과를 발휘하여 건강한 관계로 발전할 수 있습니다."
      },
      "bad": {
        "name": "ENFP",
        "description": "ESTP는 빠르게 상황을 판단합니다. 그만큼 상황 자체만을 보고 단순히 옳고 그름을 논리적으로 생각하는 반면에 ENFP는 상황 너머의 보이지 않는 이면까지 파악하고 결정을 내리려는 성향이 있어서 갈등이 생길 수 있습니다. ESTP는 현실적인 관점에서 모든 문제를 해결하려 하지만 ENFP는 미래의 가능성을 중요하게 생각하기 때문에 장기적으로 관계를 이어갈 때 충분히 대화를 하는 것이 중요합니다."
      }
    }
  },
  {
    "name": "ESFP",
    "summary": "자유로운 영혼의 연예인",
    "count": 0,
    "tag": [
      "모임조아",
      "수다쟁이",
      "금사빠",
      "이구역감초"
    ],
    "content": {
      "description": "ESFP 유형은 친절하고 수용적이며 현실적이고 실제적입니다. 어떤 상황에도 잘 적응하며 타협적입니다. 선입견이 별로 없으며 개방적이고 관용적이며 대체로 사람들을 잘 받아들입니다. 주위에서 진행되고 있는 일들을 알고자 하고 또한 열심히 참견하고 끼어들곤 합니다. 다른 사람의 일이나 활동에 관심이 많으며 새로운 사건 혹은 물건에도 관심과 호기심이 많기 때문입니다. 이론이나 책을 통해 배우기보다 경험 등의 실생활을 통해 배우는 것을 선호합니다.",
      "good": {
        "name": "ISTJ",
        "description": "외향적인 성격의 E 유형들은 ISTJ의 '의무수행자' 로서의 성격을 부드럽게 수용합니다. 또한 ESFP는 ISTJ의 마음을 여는 데에서 수월합니다. ISTJ의 판단 능력은 그들을 뛰어난 의사 결정자로 만들어 주고 체계나 질서에 대한 갈망을 가지게 하는 반면 ,인식(P) 성향의 사람들은 느긋하게 앉아 유연한 라이프 스타일을 즐기기 때문에 ISTJ의 불안함을 덜어줄 수 있는 관계입니다."
      },
      "bad": {
        "name": "ENTP",
        "description": "두 유형 모두 유머감각이 뛰어나고 가벼운 태도를 보이기 쉽지만 외부로 드러내지 않는 경쟁심이 강할 수 있어 갈등이 생겼을 때 양보와 타협이 어려울 수 있습니다. ESFP는 자신이 하고 싶은대로 행동하는 것처럼 보이지만 실은 주변 사람들에게 좋은 모습을 보일 수 있는 방향으로 움직이려 하고 ENTP는 주변의 상황이나 반응에 큰 영향을 받지 않고 자신의 내면에 집중하기 때문에 같은 행동을 하지만 서로 기대하는 부분의 차이가 커서 갈등의 요인이 될 수 있습니다."
      }
    }
  },
  {
    "name": "ESTJ",
    "summary": "엄격한 관리자",
    "count": 0,
    "tag": [
      "책임감",
      "중간보고해줘",
      "일잘러",
      "똑부러짐"
    ],
    "content": {
      "description": "ESTJ 유형은 일을 조직하고 프로젝트를 계획하고 출범시키는 능력이 뛰어납니다. 현실적이고 사실적이며 체계적, 논리적으로 사업이나 조직체를 이끌어가는 타고난 재능을 가졌기 때문입니다. 혼돈스러운 상태나 불분명한 상태 또는 실용성이 없는 분야에는 큰 흥미가 없습니다. 그러나 필요시에는 언제나 응용하는 힘이 있습니다. 분명한 규칙을 중요시하고 그에 따라 행동하고 일을 추진하고 완성해 나갑니다. 어떤 계획이나 결정을 내릴 때 확고한 사실에 바탕을 두고 이행합니다. 대체로 결과를 현재 볼 수 있는 일을 즐기는 편입니다.",
      "good": {
        "name": "ISTJ",
        "description": "ISTJ와 ESTJ는 모두 현실적이고 실제적인 성향을 가지며 체계적으로 사고하는 점에서 비슷합니다. 서로의 믿음과 책임감에 대해 서로 이해할 수 있습니다."
      },
      "bad": {
        "name": "INFP",
        "description": "INFP는 감정 중심적이고 이상적인 성향을 가집니다. 반면, ESTJ는 현실적이고 논리적으로 접근하기 때문에 이들 간의 의사 소통과 가치관 충돌이 발생할 수 있습니다."
      }
    }
  },
  {
    "name": "ESFJ",
    "summary": "사교적인 외교관",
    "count": 0,
    "tag": [
      "칭찬자판기",
      "매사에열정적",
      "완벽주의자",
      "본투비리더"
    ],
    "content": {
      "description": "ESFJ 유형은 유난히 동정심과 동료애가 많습니다. 친절하고 재치가 있으며, 다른 사람들에게 관심을 쏟고 인화를 도모하는 일을 중요하게 여깁니다. 양심적이고 정리정돈을 잘합니다. 참을성이 많고 다른 사람들을 잘 돕습니다. 또한 다른 사람들의 지지를 받으면 일에 열중합니다. 그러나 다른 사람들의 무관심한 태도에는 민감합니다.",
      "good": {
        "name": "ISFP",
        "description": " ISFP와 ESFJ는 둘 다 현실적이고 감정 중심적인 성향을 가지고 있습니다. 그러나 ISFP는 더욱 개인적인 관심사와 민감한 면을 가지고 있어서 서로를 보완할 수 있습니다."
      },
      "bad": {
        "name": "INTP",
        "description": "INTP는 논리적이고 분석적인 성향을 가지고 있습니다. 이들은 자신만의 개인적인 시간과 공간을 필요로 하고, ESFJ의 사교성과 충돌이 발생할 수 있습니다."
      }
    }
  },
  {
    "name": "INTP",
    "summary": "논리적인 사색가",
    "count": 0,
    "tag": [
      "결과보다과정",
      "강강약약",
      "돌직구머신",
      "똑똑함"
    ],
    "content": {
      "description": "INTP 유형은 조용하고 과묵하나 관심이 있는 분야에 대해서는 말을 잘합니다. 사람들을 중심으로 한 가치보다는 아이디어에 관심이 많으며 매우 분석적이고 논리적이며 객관적 비평을 잘합니다. 일의 원리와 아이디어에 관심이 많으며, 실체보다는 실체가 안고 있는 가능성에 관심이 많습니다. 이해가 빠르고 높은 직관력으로 통찰하는 재능과 지적 관심이 많습니다. 개인적인 인간관계나 파티 혹은 잡담 등에는 흥미가 별로 없습니다. 사람을 사귀는 데 있어서 그들은 보통 아이디어를 토론하고 나누는 소수의 가까운 사람들을 주위에 두고 있습니다. 때로 어떤 아이디어에 몰입하여 주위에서 돌아가고 있는 일을 모를 때가 많습니다.",
      "good": {
        "name": "ENTJ",
        "description": "ENTJ는 열정적이고 목표 지향적인 성격으로, INTP가 가지고 있는 독창적인 아이디어와 분석적인 사고방식을 존중하고 발전시킬 수 있습니다. ENTJ는 INTP의 분석적인 능력을 존중하며, INTP는 ENTJ가 갖고 있는 지도력과 실행력에 대해 긍정적으로 생각합니다."
      },
      "bad": {
        "name": "ESFP",
        "description": "INTP는 주로 논리와 사고에 더 집중하며 감정적인 측면에 덜 민감합니다. ESFP는 반면에 다른 사람과의 감정적인 연결과 사회적 상호작용을 중요시하는 경향이 있습니다. 따라서 INTP와 ESFP는 감정적인 표현에 있어서 서로 이해하기 어려울 수 있으며, 이로 인해 의사소통에 어려움을 겪을 수 있습니다."
      }
    }
  },
  {
    "name": "INFP",
    "summary": "열정적인 중재자",
    "count": 0,
    "tag": [
      "조용한관종",
      "낭만파",
      "애늙은이",
      "공감능력만렙"
    ],
    "content": {
      "description": "INFP 유형은 마음이 따뜻하나, 상대방을 잘 알기 전에는 표현을 잘하지 않습니다. 조용하며, 자신이 관계하는 사람이나 일에 대하여 강하고 성실합니다. 또한 자신이 지향하는 이상에 대하여는 정열적인 신념을 지니고 있습니다.",
      "good": {
        "name": "ENFJ",
        "description": "ENFJ는 친절하고 사람을 좋아하는 성격으로, INFP가 갖고 있는 따뜻하고 이해심 깊은 면을 이해하고 존중합니다. INFP는 ENFJ가 갖고 있는 인간관계에서의 지혜와 리더십에 대해 감사하게 생각합니다."
      },
      "bad": {
        "name": "ESTJ",
        "description": "ESTJ는 현실적이고 논리적인 사고를 선호하며, INFP의 감성적인 일에 대해 이해와 존중을 보여주지 않을 수 있습니다. 또한 ESTJ는 사실을 중요시하기 때문에, INFP의 감성적인 판단에 대해 불신을 품을 수 있습니다. 이러한 가치관과 성향의 차이로 인해 충돌이 발생할 가능성이 높습니다."
      }
    }
  },
  {
    "name": "INTJ",
    "summary": "용의주도한 전략가",
    "count": 0,
    "tag": [
      "상상력",
      "독립적",
      "철두철미",
      "모든걸분석하고싶어"
    ],
    "content": {
      "description": "INTJ 유형은 행동과 사고에 있어 독창적입니다. 내적인 신념과 비전은 산이라도 움직일 만큼 강합니다. 16가지 유형 중에서 가장 독립적이고 단호합니다. 때때로 어떤 문제에 대하여 아주 고집에 셉니다. 자신이 가진 영감과 목적을 실현시키려는 의지와 결단력과 인내심을 가지고 있습니다. 자신과 타인의 능력을 중요시하며, 목적달성을 위하여 온 시간과 노력을 다 바쳐 일합니다. 직관력과 통찰력이 활용되는 분야에서 능력을 발휘하는 편입니다.",
      "good": {
        "name": "ENFP",
        "description": "내성적이며 무뚝뚝한 INTJ는 ENFP의 장난스럽고 재미있고 개방적인 특성에 매력을 느낍니다. ENFP는 그들이 안전지대에서 벗어나 새로운 것을 시도하도록 격려합니다. 반대로 ENFP도 INTJ의 지적이고 단호하며 신중한 성격에 매력을 느낍니다. 특히 INTJ는 ENFP의 크지만 다소 추상적인 계획을 구체적인 계획으로 전환시켜 실행할 수 있도록 도움을 줍니다. "
      },
      "bad": {
        "name": "ISFJ",
        "description": "서로간의 추구하는 가치가 달라 성격적인 부분에서 충돌할 가능성이 높으며, INTJ는 직설적인 표현을, ISFJ는 배려하는 표현을 선호하기 때문에 의사표현 때문에 오해가 생길 수 있습니다."
      }
    }
  },
  {
    "name": "INFJ",
    "summary": "선의의 옹호자",
    "count": 0,
    "tag": [
      "공동체",
      "좋은사람이되고싶어",
      "통찰력",
      "샘솟는영감"
    ],
    "content": {
      "description": "INFJ 유형은 창의력과 통찰력이 뛰어납니다. 강한 직관력으로 의미와 진실된 관계를 추구합니다. 뛰어난 영감으로 말없이 타인에게 영향력을 끼칩니다. 독창성과 사적인 독립심이 강합니다. 또한 확고한 신념과 뚜렷한 원리원칙을 생활 속에 가지고 있으면서 공동의 이익을 가져오는 일에 심혈을 기울입니다. 인화와 동료애를 중시하는 경향으로 존경을 받고 사람들이 따릅니다. 열정과 신념으로 자신들이 믿는 영감을 구현 시켜 나갈 때 위대한 정신적 지도자들이 이 유형에서 많이 나옵니다. 남에게 강요하기보다 행동과 권유로 사람들의 마음을 움직여 따르게 만드는 지도력이 있습니다.",
      "good": {
        "name": "ENTP",
        "description": "INFJ는 ENTP의 자신감, 에너지, 똑똑함에 에너지를 느낍니다. ENTP는 INFJ의 껍데기를 깨부수어 다양한 경험을 하고 성장하게 도와줍니다. 반면에 ENTP는 INFJ 차분한 면과 창의적이고 수용적인 성격에 매력을 느낍니다. INFJ는 성격이 급한 ENTP의 일을 순조롭게 진행할 수 있도록 돕고 진정시킵니다."
      },
      "bad": {
        "name": "ESTJ",
        "description": "둘의 관점과 가치관이 많이 달라 잘 조율하지 않으면 갈등이 생길 수 있는 관계입니다. INFJ는 규정 준수, 도덕적이고 윤리적인 것 등 이상적 가치에 관심이 많고, 반대로 ESTJ는 현실적이고 목표를 달성하기 위해 효율성을 추구하는 경향이 있습니다. 좋은 관계를 맺기 위해서는 적절한 조율이 필요합니다."
      }
    }
  },
  {
    "name": "ISTP",
    "summary": "만능 재주꾼",
    "count": 0,
    "tag": [
      "개인주의",
      "너무솔직",
      "완벽하게대충하기",
      "쉽게기빨림"
    ],
    "content": {
      "description": "ISTP 유형은 조용하고 말이 없으며 논리적이고 분석적이고 객관적으로 인생을 관찰하는 유형입니다. 사실적인 정보를 조직하기 좋아하는 반면 일과 관계 되지 않는 이상 자신을 개방하지 않는 편입니다. 그래서 가까운 친구들 외에는 대체로 사람들과 사귀지 않는 편입니다. 일상생활에 있어 매우 적응력이 강합니다.",
      "good": {
        "name": "ESFJ",
        "description": "귀찮음이 심한 ISTP 유형은 다른 사람들과의 연락조차 귀찮아하기 때문에 해바라기처럼 본인의 애인 하나만 바라보는 타입입니다. 또한, 개인주의적 성향이 강한 이들은 보통 집순이 집돌이 유형이 많고 애인과의 시간을 보내는 것도 좋아하지만 혼자만의 시간도 꼭 필요한 성격유형입니다. 한편 감정 표현을 잘 하지 않는 편이고 감정적 공감 능력이 부족하고 이성적으로 생각하려고 합니다."
      },
      "bad": {
        "name": "INFP",
        "description": "ST 유형은 현실적인 유형으로 감정적인 대화를 하는 NF와의 궁합은 별로 좋지 않습니다. ISTP는 상대방의 기분을 생각해 주는 말을 잘 못하고 본인이 힘든 일을 당했더라도 상대방의 감정적인 위로를 잘 이해하지 못할 수 있습니다."
      }
    }
  },
  {
    "name": "ISFP",
    "summary": "호기심 많은 예술가",
    "count": 0,
    "tag": [
      "그렇구나~",
      "느릿느릿",
      "배려형개인주의",
      "느낌으로결정"
    ],
    "content": {
      "description": "ISFP 유형은 말보다는 행동으로 따뜻함을 나타내며, 마음이 따뜻하고 동정적입니다. 마치 양털안감을 넣은 오버코트처럼 속마음이 따뜻한 사람들입니다. 그러나 상대방을 잘 알게 될 때까지 이 따뜻함을 잘 드러내지 않는 경향이 있습니다.",
      "good": {
        "name": "ENFJ",
        "description": "ISFP 유형은 구속당하는 것을 싫어하는 자유로운 성격 유형입니다. 성인군자형으로 불리는 이들은 타인의 감정에 대해서 공감하는 능력이 높고 눈치도 빠른 편입니다. 하지만 본인이 싫은소리, 거절을 잘 하지 못하고 힘든 것들에 대해 내색하지 않아서 이런 것들에 대해 주변 사람들이 파악하지 못하면 속에서 혼자 삭히기도 합니다."
      },
      "bad": {
        "name": "INFP",
        "description": "ISFP 유형은 연애를 하면서도 혼자만의 시간이 필요한 유형입니다. 상대방에게 올인하고 우선하기도 하지만 그만큼 에너지가 쉽게 방전되며 이것에 대해서도 티를 내지 않습니다. 이때 혼자 있을 시간을 주지 않으면 혼자서 고통받을 수 있습니다. 한편 즉흥적이고 새롭고 재미있는 것을 좋아하는 이들의 자유로운 성격을 이해해 주는 사람들과 좋은 관계를 맺을 수 있습니다."
      }
    }
  },
  {
    "name": "ISTJ",
    "summary": "청렴결백 논리주의자",
    "count": 0,
    "tag": [
      "데이터만믿어",
      "K장남장녀",
      "현실주의자",
      "프로갓생러"
    ],
    "content": {
      "description": "ISTJ 유형은 매우 신뢰성이 있고, 사실에 대한 완전하고, 현실적이고, 실용적인 면을 가지고 있습니다. 어떠한 분량의 사실이라도 몰두하고, 기억하며, 이용하고, 정확도에 대해 매우 세심합니다. 위기상황에 대처할 때에도 차분하며 안정되어 있습니다. 그들이 어떤 사람인가를 아는 데는 상당한 시간이 걸립니다. 그들은 외면적으로 볼 때 차분하게 보이지만, 내면적으로는 상당히 바쁩니다.",
      "good": {
        "name": "ESTP",
        "description": "ESTP와 ISTJ는 서로를 보완할 수 있는 관계를 형성할 수 있습니다. ESTP는 능동적이고 즉흥적인 성향으로 ISTJ가 갖기 어려운 새로운 경험을 제공하고, ISTJ는 ESTP에게 안정감과 구체적인 계획을 제공할 수 있습니다."
      },
      "bad": {
        "name": "INFP",
        "description": "INFP와 ISTJ는 인식과 판단의 차이로 인해 갈등이 발생할 수 있습니다. INFP는 감정적인 면이 강한 반면, ISTJ는 감정을 덜 드러내기 때문입니다. 이러한 차이로 인해 의사소통과 결정에 어려움을 겪을 수 있습니다."
      }
    }
  },
  {
    "name": "ISFJ",
    "summary": "용감한 수호자",
    "count": 0,
    "tag": [
      "인내의장인",
      "게으른완벽주의",
      "눈치백단",
      "세심보스"
    ],
    "content": {
      "description": "ISFJ 유형은 책임감이 강하고 온정적이며 헌신적입니다. 세부적이고 치밀성과 반복을 요하는 일을 끝까지 해 나가는 인내력이 높습니다. 이들이 가진 침착성과 인내력은 가정이나 집단에 안정성을 가져다줍니다. 다른 사람의 사정을 고려하며 자신과 타인의 감정의 흐름에 민감합니다. 일처리에 있어 현실감각을 가지고 실제적이고 조직적으로 이행합니다. 경험을 통해서 자신이 틀렸다고 인정하기까지 어떠한 난관이 있어도 꾸준히 밀고 나가는 유형입니다. 온순하고 차분합니다.",
      "good": {
        "name": "ESFJ",
        "description": "ESFJ와 ISFJ는 둘 다 센서적이고 감정 중심의 유형이며, 동일한 주변 세계를 공유하기 때문에 서로를 이해하기 쉬울 수 있습니다"
      },
      "bad": {
        "name": "ENTP",
        "description": "ISFJ는 감정 중심이고 안정적인 관계를 선호하지만, ENTP는 비평적이고 변덕스러운 경향이 있을 수 있습니다."
      }
    }
  }
]